app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jase"], ["password_digest", "$2a$10$5bxmuGal7oM5KLVrd9FqU.nS85/BMx5bSNNLK0pzZWW.AlogcbLgO"], ["created_at", "2018-09-03 18:39:35.861023"], ["updated_at", "2018-09-03 18:39:35.861023"]]
---
  def create
    @user = User.new(user_params)
    @user.password= params[:password]
    @user.save!